bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  return true;
}

/**
 * Build and send a MeshCore channel message via LoRa
 * @param message Message text to send
 * @return true if message was sent successfully
 */
bool sendLoRaChannelMessage(const String& message) {
  if (!ensureLoRaTransportInitialized()) {
    return false;
  }
  
  // Build MeshCore packet for channel message
  std::vector<uint8_t> payload;
  
  payload.push_back(LORA_TXT_TYPE_PLAIN);
  payload.push_back(LORA_DEFAULT_CHANNEL_INDEX);
  
  // Timestamp (little-endian, 4 bytes)
  time_t now = time(nullptr);
  uint32_t timestamp = static_cast<uint32_t>(now);
  payload.push_back(static_cast<uint8_t>(timestamp & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 8) & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 16) & 0xFF));
  payload.push_back(static_cast<uint8_t>((timestamp >> 24) & 0xFF));
  
  // Message text (truncate if too long)
  size_t textLen = message.length();
  if (textLen > LORA_MAX_TEXT_MESSAGE_LEN) {
    textLen = LORA_MAX_TEXT_MESSAGE_LEN;
  }
  payload.insert(payload.end(), message.begin(), message.begin() + textLen);
  
  // Send using frame codec
  return meshCodec->sendFrame(LORA_CMD_SEND_CHANNEL_TXT_MSG, payload);
}
#endif

// Minimum valid Unix timestamp for NTP validation (2021-01-01 00:00:00 UTC)
// Used to detect if time has been properly synchronized via NTP
const time_t MIN_VALID_TIMESTAMP = 1609459200;

// Pending MeshCore notification - used to defer BLE operations from HTTP handlers and boot
// This prevents task watchdog timeouts by:
// 1. Allowing the async web server to complete HTTP response delivery before WiFi disconnects
// 2. Deferring boot notifications until after setup() completes to avoid watchdog timeouts
volatile bool pendingMeshNotification = false;
String pendingMeshTitle = "";
String pendingMeshMessage = "";

// Helper functions to access protocol state (for API compatibility)
bool isMeshDeviceConnected() {
  return meshTransport != nullptr && meshTransport->isConnected();
}

bool isMeshChannelReady() {
#ifdef HAS_LORA_RADIO
  // For LoRa mode, channel is ready when transport is initialized
  return meshTransport != nullptr && meshTransport->isInitialized();
#else
  return meshProtocol != nullptr && meshProtocol->isChannelReady();
#endif
}

String getMeshLastError() {
#ifdef HAS_LORA_RADIO
  if (meshTransport != nullptr) {
    return meshTransport->getLastError();
  }
  return "";
#else
  if (meshProtocol != nullptr) {
    return meshProtocol->getLastError();
  }
  if (meshTransport != nullptr) {
    return meshTransport->getLastError();
  }
  return "";
#endif
}

int getMeshProtocolState() {
#ifdef HAS_LORA_RADIO
  // For LoRa mode, return 3 (SessionReady equivalent) if initialized
  return (meshTransport != nullptr && meshTransport->isInitialized()) ? 3 : 0;
#else
  if (meshProtocol != nullptr) {
    return static_cast<int>(meshProtocol->getState());
  }
  return 0;
#endif
}

// Service types
// Right now the behavior for each is rudimentary
// However, you can use this to expand and add services with more complex checks
enum ServiceType {
  TYPE_HTTP_GET,
  TYPE_PING,
  TYPE_SNMP_GET,
  TYPE_PORT,
  TYPE_PUSH
};

// SNMP comparison operators for value checks
enum SnmpCompareOp {
  SNMP_OP_EQ,    // Equal (=)
  SNMP_OP_NE,    // Not equal (<>)
  SNMP_OP_LT,    // Less than (<)
  SNMP_OP_LE,    // Less than or equal (<=)
  SNMP_OP_GT,    // Greater than (>)
  SNMP_OP_GE     // Greater than or equal (>=)
};

// Service structure
struct Service {
  String id;
  String name;
  ServiceType type;
  String host;
  int port;
  String path;
  String url;             // Full URL for HTTP GET (http:// or https://)
  String expectedResponse;
  int checkInterval;
  int passThreshold;      // Number of consecutive passes required to mark as UP
  int failThreshold;      // Number of consecutive fails required to mark as DOWN
  int rearmCount;         // Number of failed checks before re-alerting (0 = disabled)
  int consecutivePasses;  // Current count of consecutive passes
  int consecutiveFails;   // Current count of consecutive fails
  int failedChecksSinceAlert; // Failed checks since last alert (for re-arm)
  bool isUp;
  bool hasBeenUp;         // Whether service has ever been UP since boot (for initial UP suppression)
  unsigned long lastCheck;
  unsigned long lastUptime;
  String lastError;
  int secondsSinceLastCheck;
  // SNMP-specific fields
  String snmpOid;         // SNMP OID to query (e.g., "1.3.6.1.2.1.1.1.0")
  String snmpCommunity;   // SNMP community string (default: "public")
  SnmpCompareOp snmpCompareOp;  // Comparison operator for SNMP value check
  String snmpExpectedValue;     // Expected value for comparison
  // Push-specific fields
  String pushToken;       // Unique token for push endpoint (for TYPE_PUSH)
  unsigned long lastPush; // Timestamp of last push received (millis)
  // Enable/disable and pause fields
  bool enabled;           // Whether service checks are enabled
  unsigned long pauseUntil; // Timestamp (millis) until which checks are paused (0 = not paused)
};

// Historical data structure for uptime tracking
// Stores hourly uptime percentage to minimize storage (1 byte per hour)
// With 1MB limit and 20 services, we can store ~52,000 hours (~6 years) per service
struct ServiceHistory {
  String serviceId;
  std::vector<uint8_t> hourlyUptime;  // Each byte is uptime % for that hour (0-100)
  unsigned long firstHourTimestamp;    // Unix timestamp of first hour in history
  int checksThisHour;                  // Number of checks performed this hour
  int passesThisHour;                  // Number of successful checks this hour
  unsigned long currentHourStart;      // Timestamp (seconds) of current hour being tracked
};

// Store up to 20 services
const int MAX_SERVICES = 20;
Service services[MAX_SERVICES];
int serviceCount = 0;

// Historical data for all services
ServiceHistory serviceHistories[MAX_SERVICES];

// Historical data constants
const int MAX_HISTORY_HOURS = 720;  // 30 days of hourly data per service (720 bytes/service)
const int DISPLAY_HISTORY_HOURS = 90;  // Show last 90 hours (~4 days) in UI for readability
const int MAX_MISSED_HOURS_TO_FILL = 24;  // Maximum gap to backfill with 0% uptime

// Filesystem readiness flag to avoid LittleFS access before mount
static bool littleFsReady = false;

// Port check constants
const int PORT_CHECK_TIMEOUT_MS = 5000;  // TCP connection timeout for port checks

// Push check constants
const unsigned long PUSH_TIMING_MARGIN_MS = 5000;  // Margin for push timing checks

