bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
// Regex matching constants
const int MAX_REGEX_PATTERN_LENGTH = 256;
const char* REGEX_PREFIX = "regex:";
const int REGEX_PREFIX_LENGTH = 6;

// Pause/enable constants
// Max pause: ~46 days to safely fit within unsigned long (millis() range)
const int MAX_PAUSE_DURATION_SECONDS = 46 * 24 * 60 * 60;  // 46 days
const unsigned long PAUSE_ROLLOVER_THRESHOLD_MS = 7UL * 24UL * 60UL * 60UL * 1000UL;  // 1 week

// Helper function for rollover-safe pause remaining calculation
// Returns pause remaining in milliseconds, or 0 if pause expired/rolled over
inline unsigned long getPauseRemainingMs(unsigned long pauseUntil, unsigned long currentTime) {
  if (pauseUntil == 0) return 0;
  // If currentTime has passed pauseUntil (normal expiry), remaining will wrap to large value
  // If pauseUntil is in the future, remaining will be the actual time left
  // Both cases are handled by the threshold check below
  unsigned long remaining = pauseUntil - currentTime;
  // If remaining is larger than threshold, assume expired or rollover/reboot
  if (remaining > PAUSE_ROLLOVER_THRESHOLD_MS) return 0;
  return remaining;
}

// Notification queue for failed notifications
// Only stores the latest notification per service (isUp state)
// Tracks which notification channels have failed
struct QueuedNotification {
  String serviceId;      // Service ID this notification is for
  String title;          // Notification title
  String message;        // Notification message
  bool isUp;             // true = online notification, false = offline notification
  String tags;           // ntfy tags (for ntfy notifications)
  bool ntfyPending;      // Needs to be sent via ntfy
  bool discordPending;   // Needs to be sent via Discord
  bool smtpPending;      // Needs to be sent via SMTP
  bool meshPending;      // Needs to be sent via MeshCore
  unsigned long lastRetry; // Last retry attempt timestamp
};

const int MAX_QUEUED_NOTIFICATIONS = MAX_SERVICES;
QueuedNotification notificationQueue[MAX_QUEUED_NOTIFICATIONS];
int queuedNotificationCount = 0;

// Retry interval for failed notifications (30 seconds for WiFi-based)
const unsigned long NOTIFICATION_RETRY_INTERVAL = 30000;

// MeshCore retry interval (10 minutes to prevent frequent WiFi disconnects)
const unsigned long MESHCORE_RETRY_INTERVAL = 600000;
unsigned long lastMeshCoreRetry = 0;

// prototype declarations
void initWiFi();
void initWebServer();
void initFileSystem();
bool ensureAuthenticated(AsyncWebServerRequest* request);
void loadServices();
void saveServices();
String generateServiceId();
String generatePushToken();
void checkServices();
void sendOfflineNotification(const Service& service);
void sendOnlineNotification(const Service& service);
void sendSmtpNotification(const String& title, const String& message);
bool checkHttpGet(Service& service);
bool checkPing(Service& service);
bool checkSnmpGet(Service& service);
bool checkPort(Service& service);
bool checkPush(Service& service);
int matchesRegex(const String& text, const String& pattern);
String getWebPage();
String getAdminPage();
String getServiceTypeString(ServiceType type);
String getSnmpCompareOpString(SnmpCompareOp op);
SnmpCompareOp parseSnmpCompareOp(const String& opStr);
String base64Encode(const String& input);
bool readSmtpResponse(WiFiClient& client, int expectedCode);
bool sendSmtpCommand(WiFiClient& client, const String& command, int expectedCode);
void sendBootNotification();

// Historical data functions
void initServiceHistory(const String& serviceId);
void recordCheckResult(const String& serviceId, bool isUp);
void saveHistory();
void loadHistory();
int getHistoryIndex(const String& serviceId);
void finalizeCurrentHour(int historyIndex);
void removeServiceHistory(const String& serviceId);

// Notification sending functions that return success status
bool sendNtfyNotificationWithStatus(const String& title, const String& message, const String& tags);
bool sendDiscordNotificationWithStatus(const String& title, const String& message);
bool sendSmtpNotificationWithStatus(const String& title, const String& message);
bool sendMeshCoreNotificationWithStatus(const String& title, const String& message);

// Notification queue functions
void queueNotification(const String& serviceId, const String& title, const String& message, 
                       bool isUp, const String& tags, bool ntfyFailed, bool discordFailed, 
                       bool smtpFailed, bool meshFailed);
void processNotificationQueue();
void processMeshCoreQueue();
int findQueuedNotification(const String& serviceId);
void removeQueuedNotification(int index);

void setup() {
  Serial.begin(115200);
  // Simple delay for serial initialization - matches working ESP32-4848S040 implementation
  // from ESP32-Uptime-Monitoring-Touch. The previous complex !Serial wait loop was causing
  // issues with serial output on this board.
  delay(1000);

  Serial.println("\n\n========================================");
  Serial.println("   ESP32 Uptime Monitor Starting...");
  Serial.println("========================================");

  // Initialize LED to booting state (blue pulsing)
  setLedStatus(LED_STATUS_BOOTING);

  // Initialize filesystem
  initFileSystem();
  Serial.printf("LittleFS ready: %s\n", littleFsReady ? "yes" : "no");

  // Initialize WiFi
  initWiFi();

  // Load saved services
  loadServices();

  // Load historical data
  loadHistory();

  // Initialize web server
  initWebServer();

  // Send boot notification if enabled and WiFi is connected
  if (BOOT_NOTIFICATION_ENABLED) {
    if (WiFi.status() == WL_CONNECTED) {
      sendBootNotification();
    } else {
      Serial.println("Boot notification skipped: WiFi not connected");
    }
  }

#ifdef HAS_LCD
  // Initialize display and touch controller (if connected)
  initDisplay();
#endif

  Serial.println("System ready!");
  Serial.print("Access web interface at: http://");
  Serial.println(WiFi.localIP());
}

void loop() {
  static unsigned long lastCheckTime = 0;
  static bool hasPerformedChecks = false;  // Track if any check has been performed
  unsigned long currentTime = millis();

#ifdef HAS_LCD
  // Re-scan I2C periodically if touch is not ready (helps debug startup issues)
  static unsigned long lastI2CScan = 0;
  if (!touchReady && (currentTime - lastI2CScan > 5000)) {
    lastI2CScan = currentTime;
    Serial.println("Touch not ready, re-scanning I2C...");
    Wire.begin(TOUCH_SDA_PIN, TOUCH_SCL_PIN);
    int devicesFound = 0;
    for (byte address = 1; address < 127; address++) {
      Wire.beginTransmission(address);
      if (Wire.endTransmission() == 0) {
        Serial.printf("I2C device found at address 0x%02X\n", address);
        devicesFound++;
      }
    }
    if (devicesFound == 0) Serial.println("No I2C devices found");
    Wire.end();
  }
#endif

