bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Update LED animation (call frequently for smooth pulsing)
  updateLed();

  // Process pending MeshCore notifications from HTTP handlers
  // This runs in the main loop to avoid blocking the async web server
  // and prevents task watchdog timeouts from WiFi/BLE switching during HTTP responses
  if (pendingMeshNotification && !bleOperationInProgress) {
    // Copy values and clear flag atomically to prevent race conditions with HTTP handler.
    // The HTTP handler checks both pendingMeshNotification and bleOperationInProgress
    // before writing, so setting the flag false first prevents new writes.
    // We use noInterrupts()/interrupts() to ensure the copy is atomic since
    // the async web server runs in a separate FreeRTOS task.
    noInterrupts();
    pendingMeshNotification = false;
    String title = pendingMeshTitle;
    String message = pendingMeshMessage;
    pendingMeshTitle = "";
    pendingMeshMessage = "";
    interrupts();
    
    sendMeshCoreNotification(title, message);
  }

  // Skip service checks if monitoring is paused (e.g., during BLE operations)
  if (monitoringPaused) {
    delay(10);
    return;
  }

  // Update LED status based on WiFi and service state
  // Priority: No WiFi > MeshCore > Service status
  if (WiFi.status() != WL_CONNECTED) {
    setLedStatus(LED_STATUS_NO_WIFI);
  } else if (!hasPerformedChecks && serviceCount > 0) {
    // Still booting - haven't done any checks yet
    setLedStatus(LED_STATUS_BOOTING);
  } else if (serviceCount == 0) {
    // No services configured - show green (nothing to monitor)
    setLedStatus(LED_STATUS_ALL_UP);
  } else {
    // Check if any enabled service is down (either active or paused)
    bool anyActiveDown = false;
    bool anyPausedDown = false;
    unsigned long currentTimeMs = millis();
    for (int i = 0; i < serviceCount; i++) {
      if (services[i].enabled && !services[i].isUp && services[i].lastCheck > 0) {
        // Check if service is paused (rollover-safe)
        if (getPauseRemainingMs(services[i].pauseUntil, currentTimeMs) > 0) {
          anyPausedDown = true;
        } else {
          anyActiveDown = true;
          break;  // Active down takes priority, no need to check further
        }
      }
    }
    // Priority: Active down (red) > Paused down (orange) > All up (green)
    if (anyActiveDown) {
      setLedStatus(LED_STATUS_ANY_DOWN);
    } else if (anyPausedDown) {
      setLedStatus(LED_STATUS_PAUSED_DOWN);
    } else {
      setLedStatus(LED_STATUS_ALL_UP);
    }
  }

  // Check services every 5 seconds
  if (currentTime - lastCheckTime >= 5000) {
    checkServices();
    lastCheckTime = currentTime;
    if (serviceCount > 0) {
      hasPerformedChecks = true;
    }
  }

  // Save history periodically (every 5 minutes)
  static unsigned long lastHistorySave = 0;
  if (currentTime - lastHistorySave >= 300000) {  // 5 minutes
    saveHistory();
    lastHistorySave = currentTime;
  }

  // Process notification queue for failed notifications (WiFi-based)
  processNotificationQueue();
  
  // Process MeshCore queue separately (batched, 10 minute interval)
  processMeshCoreQueue();
  
  // Handle OTA update events
  ElegantOTA.loop();

#ifdef HAS_LCD
  // Handle LCD display updates and touch input
  handleDisplayLoop();
#endif

  delay(10);
}

void initWiFi() {
  Serial.println("Connecting to WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
    // Update LED during WiFi connection attempts
    updateLed();
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
    
    // Synchronize time via NTP - required for MeshCore message timestamps
    // Uses UTC (gmtOffset=0, daylightOffset=0) for consistent Unix timestamps
    Serial.println("Synchronizing time via NTP...");
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
    
    // Wait for time to be set (with timeout)
    // Blocking is acceptable here since web server hasn't started yet
    time_t now = 0;
    int ntpAttempts = 0;
    while (now < MIN_VALID_TIMESTAMP && ntpAttempts < 10) {
      delay(500);
      time(&now);
      ntpAttempts++;
    }
    
    if (now >= MIN_VALID_TIMESTAMP) {
      Serial.printf("Time synchronized: %lu\n", (unsigned long)now);
    } else {
      Serial.println("Warning: NTP time sync failed, timestamps may be incorrect");
    }
  } else {
    Serial.println("\nFailed to connect to WiFi!");
    // Set LED to orange to indicate no WiFi
    setLedStatus(LED_STATUS_NO_WIFI);
  }
}

void initMeshCore() {
  Serial.println("Initializing MeshCore protocol stack...");
  Serial.printf("Free heap before init: %d bytes\n", ESP.getFreeHeap());
  
#ifdef HAS_LORA_RADIO
  // LoRa mode: Use built-in SX1262 radio
  LoRaTransport::Config config;
  config.pinNss = LORA_NSS;
  config.pinDio1 = LORA_DIO1;
  config.pinRst = LORA_RST;
  config.pinBusy = LORA_BUSY;
  config.pinMosi = LORA_MOSI;
  config.pinMiso = LORA_MISO;
  config.pinSck = LORA_SCK;
  config.frequency = LORA_FREQUENCY;
  config.bandwidth = LORA_BANDWIDTH;
  config.spreadingFactor = LORA_SPREADING_FACTOR;
  config.codingRate = LORA_CODING_RATE;
  config.syncWord = LORA_SYNC_WORD;
  config.txPower = LORA_TX_POWER;
  
  meshTransport = new LoRaTransport(config);
  meshCodec = new FrameCodec(*meshTransport);
  
  // Initialize the LoRa radio
  if (!meshTransport->init()) {
    Serial.println("ERROR: LoRa radio initialization failed");
    disconnectMeshCore();
    return;
  }
  
  Serial.println("MeshCore LoRa radio ready");
#else
  // BLE mode: Connect to external MeshCore device
  // Create the layered protocol stack
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  meshTransport = new BLECentralTransport(config);
  meshCodec = new FrameCodec(*meshTransport);
  meshProtocol = new CompanionProtocol(*meshTransport, *meshCodec);
  
