bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Handle empty URL
  if (url.length() == 0) {
    service.lastError = "URL not configured";
    return false;
  }
  
  // Handle HTTPS URLs by using WiFiClientSecure
  bool isSecure = url.startsWith("https://");
  WiFiClient* client = nullptr;
  WiFiClient plainClient;
  WiFiClientSecure secureClient;

  if (isSecure) {
    secureClient.setInsecure();  // Skip certificate validation for HTTPS targets
    client = &secureClient;
  } else {
    client = &plainClient;
  }

  // Ensure the underlying client stays in scope for the full request lifecycle
  if (!http.begin(*client, url)) {
    service.lastError = "Invalid URL";
    return false;
  }

  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      if (service.expectedResponse == "*") {
        isUp = true;
      } else {
        String payload = http.getString();
        // Check if expectedResponse is a regex pattern (prefixed with "regex:")
        if (service.expectedResponse.startsWith(REGEX_PREFIX)) {
          String pattern = service.expectedResponse.substring(REGEX_PREFIX_LENGTH);
          int regexResult = matchesRegex(payload, pattern);
          if (regexResult == 0) {
            isUp = true;
          } else if (regexResult == -1) {
            service.lastError = "Regex pattern too long";
          } else if (regexResult == -2) {
            service.lastError = "Invalid regex pattern";
          } else {
            service.lastError = "Regex mismatch";
          }
        } else {
          // Plain substring match
          isUp = payload.indexOf(service.expectedResponse) >= 0;
          if (!isUp) {
            service.lastError = "Response mismatch";
          }
        }
      }
    } else {
      service.lastError = "HTTP " + String(httpCode);
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkPing(Service& service) {
  bool success = Ping.ping(service.host.c_str(), 3);
  if (!success) {
    service.lastError = "Ping timeout";
  }
  return success;
}

bool checkPort(Service& service) {
  WiFiClient client;
  // Attempt TCP connection with configured timeout
  if (client.connect(service.host.c_str(), service.port, PORT_CHECK_TIMEOUT_MS)) {
    client.stop();
    return true;
  }
  service.lastError = "Port closed or unreachable";
  return false;
}

bool checkPush(Service& service) {
  // For push-based services, check if a push was received within the check interval
  unsigned long currentTime = millis();
  
  // If no push has ever been received, treat as not up yet
  if (service.lastPush == 0) {
    service.lastError = "No push received yet";
    return false;
  }
  
  // Check if a push was received within the last check interval period
  // We add some margin to account for timing variations
  unsigned long pushAge = currentTime - service.lastPush;
  unsigned long intervalMs = (unsigned long)service.checkInterval * 1000UL;
  
  if (pushAge <= intervalMs + PUSH_TIMING_MARGIN_MS) {
    return true;
  }
  
  service.lastError = "No push received within interval";
  return false;
}

// Helper function to compare SNMP values based on operator
bool compareSnmpValue(const String& actualValue, SnmpCompareOp op, const String& expectedValue) {
  // Try numeric comparison first
  bool actualIsNumeric = true;
  bool expectedIsNumeric = true;
  float actualNum = 0;
  float expectedNum = 0;
  
  // Check if actual value is numeric
  if (actualValue.length() > 0) {
    char* endPtr;
    actualNum = strtof(actualValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      actualIsNumeric = false;
    }
  } else {
    actualIsNumeric = false;
  }
  
  // Check if expected value is numeric
  if (expectedValue.length() > 0) {
    char* endPtr;
    expectedNum = strtof(expectedValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      expectedIsNumeric = false;
    }
  } else {
    expectedIsNumeric = false;
  }
  
  // Use numeric comparison if both are numeric
  if (actualIsNumeric && expectedIsNumeric) {
    switch (op) {
      case SNMP_OP_EQ: return actualNum == expectedNum;
      case SNMP_OP_NE: return actualNum != expectedNum;
      case SNMP_OP_LT: return actualNum < expectedNum;
      case SNMP_OP_LE: return actualNum <= expectedNum;
      case SNMP_OP_GT: return actualNum > expectedNum;
      case SNMP_OP_GE: return actualNum >= expectedNum;
    }
  }
  
  // Fall back to string comparison for non-numeric values
  int cmp = actualValue.compareTo(expectedValue);
  switch (op) {
    case SNMP_OP_EQ: return cmp == 0;
    case SNMP_OP_NE: return cmp != 0;
    case SNMP_OP_LT: return cmp < 0;
    case SNMP_OP_LE: return cmp <= 0;
    case SNMP_OP_GT: return cmp > 0;
    case SNMP_OP_GE: return cmp >= 0;
  }
  
  return false;
}

bool checkSnmpGet(Service& service) {
  // Resolve hostname to IP
  IPAddress targetIP;
  if (!WiFi.hostByName(service.host.c_str(), targetIP)) {
    service.lastError = "DNS resolution failed";
    return false;
  }
  
  // Create SNMP objects for this request
  WiFiUDP udp;
  SNMPManager snmpManager(service.snmpCommunity.c_str());
  SNMPGet snmpRequest(service.snmpCommunity.c_str(), 1);  // SNMP version 2c (0=v1, 1=v2c)
  
  // Initialize SNMP manager
  snmpManager.setUDP(&udp);
  snmpManager.begin();
  
  // Use local variables to avoid thread safety issues
  // Use special marker values to detect if they were updated
  char stringValue[256];
  char* stringValuePtr = stringValue;
  stringValue[0] = '\0';
  
  // Use special marker value that's unlikely to be a real SNMP response
  // INT32_MIN is used as a sentinel to detect if the value was updated
  int intValue = INT32_MIN;
  
  String responseValue = "";
  bool gotResponse = false;
  
  // Add handler for string values (covers most SNMP types including OctetString)
  ValueCallback* stringCallback = snmpManager.addStringHandler(targetIP, service.snmpOid.c_str(), &stringValuePtr);
  
  // Also add integer handler for numeric values
  ValueCallback* intCallback = snmpManager.addIntegerHandler(targetIP, service.snmpOid.c_str(), &intValue);
  
