bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  Serial.println("SMTP notification sent");
  return true;
}

bool sendMeshCoreNotificationWithStatus(const String& title, const String& message) {
#ifdef HAS_LORA_RADIO
  // LoRa mode: Send directly using the built-in radio
  // No WiFi/radio coexistence issues - both can run simultaneously
  
  Serial.println("Starting MeshCore notification (LoRa)...");
  
  // Set LED to white to indicate MeshCore communication
  setLedStatus(LED_STATUS_MESHCORE);
  
  // Build the message: combine title and message
  String fullMessage = title + ": " + message;
  
  // Send using helper function
  bool success = sendLoRaChannelMessage(fullMessage);
  if (success) {
    Serial.println("MeshCore LoRa notification sent successfully");
  } else {
    if (meshTransport != nullptr) {
      Serial.printf("MeshCore LoRa notification failed: %s\n", meshTransport->getLastError().c_str());
    } else {
      Serial.println("MeshCore LoRa notification failed: transport not initialized");
    }
  }
  
  return success;
  
#else
  // BLE mode: ESP32-S3 cannot run WiFi and BLE simultaneously
  // Disconnect WiFi, connect BLE, send message, disconnect BLE, reconnect WiFi
  
  Serial.println("Starting MeshCore notification (BLE operation)...");
  
  // Set LED to white to indicate MeshCore communication
  setLedStatus(LED_STATUS_MESHCORE);
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Create the layered protocol stack on heap to reduce stack usage.
  // Stack overflow can occur when these large objects are combined with
  // deep BLE callback chains during sendTextMessageToChannel.
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport* transport = new BLECentralTransport(config);
  FrameCodec* codec = new FrameCodec(*transport);
  CompanionProtocol* protocol = new CompanionProtocol(*transport, *codec);
  
  bool success = false;
  bool channelSent = false;
  bool roomServerSent = false;
  
  // Initialize and connect
  if (transport->init()) {
    if (transport->connect()) {
      // Start session
      if (protocol->startSession("ESP32-Uptime")) {
        // Build the message: combine title and message
        String fullMessage = title + ": " + message;
        
        // Send to channel if configured
        if (isMeshChannelConfigured()) {
          uint8_t channelIdx;
          if (protocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
            if (protocol->sendTextMessageToChannel(channelIdx, fullMessage)) {
              Serial.println("MeshCore channel notification sent successfully");
              channelSent = true;
            } else {
              Serial.printf("MeshCore channel notification failed: send error - %s\n", protocol->getLastError().c_str());
            }
          } else {
            Serial.printf("MeshCore channel notification skipped: channel not found - %s\n", protocol->getLastError().c_str());
          }
        }
        
        // Send to room server if configured
        if (isMeshRoomServerConfigured()) {
          if (protocol->sendTextMessageToContact(BLE_MESH_ROOM_SERVER_ID, fullMessage, BLE_MESH_ROOM_SERVER_PASSWORD)) {
            Serial.println("MeshCore room server notification sent successfully");
            roomServerSent = true;
          } else {
            Serial.printf("MeshCore room server notification failed: send error - %s\n", protocol->getLastError().c_str());
          }
        }
        
        // Success if at least one destination received the message
        success = channelSent || roomServerSent;
      } else {
        Serial.printf("MeshCore notification skipped: session start failed - %s\n", protocol->getLastError().c_str());
      }
    } else {
      Serial.printf("MeshCore notification skipped: not connected - %s\n", transport->getLastError().c_str());
    }
  } else {
    Serial.printf("MeshCore notification skipped: BLE init failed - %s\n", transport->getLastError().c_str());
  }
  
  // Clear callbacks before cleanup to prevent use-after-free.
  // BLE callbacks could fire during disconnect/deinit and would reference deleted objects.
  codec->clearCallbacks();
  
  // Disconnect BLE and deinitialize to free resources
  transport->disconnect();
  transport->deinit();
  
  // Clean up heap-allocated objects
  delete protocol;
  delete codec;
  delete transport;
  
  // Reconnect WiFi
  reconnectWiFi();
  
  // Resume monitoring
  bleOperationInProgress = false;
  monitoringPaused = false;
  
  Serial.println("MeshCore notification operation complete");
  return success;
#endif
}

// Notification queue helper functions

int findQueuedNotification(const String& serviceId) {
  for (int i = 0; i < queuedNotificationCount; i++) {
    if (notificationQueue[i].serviceId == serviceId) {
      return i;
    }
  }
  return -1;
}

void removeQueuedNotification(int index) {
  if (index < 0 || index >= queuedNotificationCount) return;
  
  // Shift remaining notifications down
  for (int i = index; i < queuedNotificationCount - 1; i++) {
    notificationQueue[i] = notificationQueue[i + 1];
  }
  queuedNotificationCount--;
  Serial.printf("Removed notification from queue, %d remaining\n", queuedNotificationCount);
}

void queueNotification(const String& serviceId, const String& title, const String& message, 
                       bool isUp, const String& tags, bool ntfyFailed, bool discordFailed, 
                       bool smtpFailed, bool meshFailed) {
  // Check if any channel actually failed
  if (!ntfyFailed && !discordFailed && !smtpFailed && !meshFailed) {
    return;  // Nothing to queue
  }
  
  // Look for existing notification for this service
  int existingIndex = findQueuedNotification(serviceId);
  
  if (existingIndex >= 0) {
    // Update existing notification with latest state
    // This ensures we only keep the most recent state (up or down)
    QueuedNotification& existing = notificationQueue[existingIndex];
    existing.title = title;
    existing.message = message;
    existing.isUp = isUp;
    existing.tags = tags;
    existing.ntfyPending = ntfyFailed;
    existing.discordPending = discordFailed;
    existing.smtpPending = smtpFailed;
    existing.meshPending = meshFailed;
    existing.lastRetry = millis();
    Serial.printf("Updated queued notification for service %s (now %s)\n", 
                  serviceId.c_str(), isUp ? "UP" : "DOWN");
  } else {
    // Add new notification to queue
    if (queuedNotificationCount >= MAX_QUEUED_NOTIFICATIONS) {
      Serial.println("Notification queue full, dropping oldest");
      removeQueuedNotification(0);
    }
    
    QueuedNotification& newNotification = notificationQueue[queuedNotificationCount];
    newNotification.serviceId = serviceId;
    newNotification.title = title;
    newNotification.message = message;
    newNotification.isUp = isUp;
    newNotification.tags = tags;
    newNotification.ntfyPending = ntfyFailed;
    newNotification.discordPending = discordFailed;
    newNotification.smtpPending = smtpFailed;
    newNotification.meshPending = meshFailed;
    newNotification.lastRetry = millis();
    queuedNotificationCount++;
    Serial.printf("Queued notification for service %s (%s), %d in queue\n", 
                  serviceId.c_str(), isUp ? "UP" : "DOWN", queuedNotificationCount);
  }
}

