bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  Service& svc = services[currentServiceIndex];
  
  // Header with back button
  display.fillRect(0, 0, width, HEADER_HEIGHT, TFT_NAVY);
  
  // Back button
  display.fillRoundRect(5, 5, 60, POWER_BUTTON_SIZE, 8, TFT_DARKGREY);
  display.drawRoundRect(5, 5, 60, POWER_BUTTON_SIZE, 8, TFT_WHITE);
  display.setTextColor(TFT_WHITE, TFT_DARKGREY);
  display.setTextSize(2);
  display.setCursor(15, 15);
  display.print("<-");
  
  // Service name in header
  display.setTextColor(TFT_CYAN, TFT_NAVY);
  display.setCursor(75, 15);
  String headerName = svc.name;
  if (headerName.length() > 18) {
    headerName = headerName.substring(0, 16) + "..";
  }
  display.print(headerName);

  // Content area
  int contentY = HEADER_HEIGHT + 10;
  
  // Status box with large indicator
  uint16_t statusColor = getServiceStatusColor(svc);
  String statusText;
  if (!svc.enabled) {
    statusText = "DISABLED";
  } else if (svc.pauseUntil > 0 && getPauseRemainingMs(svc.pauseUntil, millis()) > 0) {
    statusText = "PAUSED";
  } else if (svc.lastCheck == 0) {
    statusText = "PENDING";
  } else {
    statusText = svc.isUp ? "UP" : "DOWN";
  }
  
  display.fillRoundRect(10, contentY, width - 20, 50, 10, statusColor);
  display.setTextColor(TFT_WHITE, statusColor);
  display.setTextSize(3);
  display.setCursor(width / 2 - statusText.length() * 9, contentY + 12);
  display.print(statusText);
  
  contentY += 60;
  
  // Service details
  display.setTextSize(2);
  display.setTextColor(TFT_YELLOW, TFT_BLACK);
  display.setCursor(10, contentY);
  display.printf("Type: %s", getServiceTypeString(svc.type).c_str());
  contentY += 25;
  
  // Host/URL information
  display.setTextColor(TFT_WHITE, TFT_BLACK);
  if (svc.type == TYPE_HTTP_GET && svc.url.length() > 0) {
    display.setCursor(10, contentY);
    display.print("URL:");
    contentY += 20;
    display.setTextSize(1);
    String urlDisplay = svc.url;
    // Wrap long URLs across multiple lines
    int lines = (urlDisplay.length() + URL_CHARS_PER_LINE - 1) / URL_CHARS_PER_LINE;
    for (int i = 0; i < lines && i < URL_MAX_LINES; i++) {
      display.setCursor(10, contentY);
      display.print(urlDisplay.substring(i * URL_CHARS_PER_LINE, min((i + 1) * URL_CHARS_PER_LINE, (int)urlDisplay.length())));
      contentY += 12;
    }
    display.setTextSize(2);
  } else if (svc.type == TYPE_PUSH) {
    display.setCursor(10, contentY);
    display.print("Push-based monitor");
    contentY += 25;
  } else if (svc.type == TYPE_PING) {
    display.setCursor(10, contentY);
    display.printf("Host: %s", svc.host.c_str());
    contentY += 25;
  } else {
    display.setCursor(10, contentY);
    display.printf("Host: %s:%d", svc.host.c_str(), svc.port);
    contentY += 25;
  }
  
  // SNMP-specific info
  if (svc.type == TYPE_SNMP_GET && svc.snmpOid.length() > 0) {
    display.setCursor(10, contentY);
    display.setTextSize(1);
    display.printf("OID: %s", svc.snmpOid.c_str());
    contentY += 15;
    display.setTextSize(2);
  }
  
  contentY += 10;
  
  // Timing information
  display.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  display.setCursor(10, contentY);
  display.printf("Interval: %ds", svc.checkInterval);
  contentY += 25;
  
  display.setCursor(10, contentY);
  if (svc.lastCheck == 0) {
    display.print("Last check: pending");
  } else {
    unsigned long sinceCheck = (millis() - svc.lastCheck) / 1000;
    display.printf("Last check: %lus ago", sinceCheck);
  }
  contentY += 25;
  
  // Thresholds
  display.setCursor(10, contentY);
  display.printf("Thresholds: %d fail / %d pass", svc.failThreshold, svc.passThreshold);
  contentY += 25;
  
  // Consecutive counts
  display.setCursor(10, contentY);
  display.printf("Consecutive: %d pass / %d fail", svc.consecutivePasses, svc.consecutiveFails);
  contentY += 25;
  
  // Pause status
  if (svc.pauseUntil > 0) {
    unsigned long remaining = getPauseRemainingMs(svc.pauseUntil, millis());
    if (remaining > 0) {
      display.setTextColor(TFT_ORANGE, TFT_BLACK);
      display.setCursor(10, contentY);
      display.printf("Paused: %lus remaining", remaining / 1000);
      contentY += 25;
    }
  }
  
  // Error message if present
  if (svc.lastError.length() > 0) {
    display.setTextColor(TFT_RED, TFT_BLACK);
    display.setCursor(10, contentY);
    display.print("Error:");
    contentY += 20;
    display.setTextSize(1);
    String errorDisplay = svc.lastError;
    if (errorDisplay.length() > 50) {
      errorDisplay = errorDisplay.substring(0, 47) + "...";
    }
    display.setCursor(10, contentY);
    display.print(errorDisplay);
  }
  display.endWrite();
}

// Handle touch input for main view
void handleMainViewTouch(int16_t x, int16_t y) {
  int16_t width = display.width();
  int16_t height = display.height();
  
  // Check power button (top right) - simple tap to turn off screen
  int powerBtnX = width - POWER_BUTTON_SIZE - 5;
  int powerBtnY = 5;
  if (x >= powerBtnX && x <= powerBtnX + POWER_BUTTON_SIZE &&
      y >= powerBtnY && y <= powerBtnY + POWER_BUTTON_SIZE) {
    turnScreenOff();
    return;
  }
  
  // Check service buttons
  if (serviceCount > 0 && y > HEADER_HEIGHT) {
    int cols = 2;
    int buttonWidth = (width - (cols + 1) * SERVICE_BUTTON_MARGIN) / cols;
    int startY = HEADER_HEIGHT + SERVICE_BUTTON_MARGIN;
    int availableHeight = height - startY - SERVICE_BUTTON_MARGIN;
    int maxRows = availableHeight / (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
    
    for (int i = 0; i < serviceCount && i < maxRows * cols; i++) {
      int row = i / cols;
      int col = i % cols;
      
      int btnX = SERVICE_BUTTON_MARGIN + col * (buttonWidth + SERVICE_BUTTON_MARGIN);
      int btnY = startY + row * (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
      
      if (x >= btnX && x <= btnX + buttonWidth &&
          y >= btnY && y <= btnY + SERVICE_BUTTON_HEIGHT) {
        // Service button tapped - show detail view
        currentServiceIndex = i;
        currentView = VIEW_DETAIL;
        displayNeedsUpdate = true;
        return;
      }
    }
  }
}

// Handle touch input for detail view
void handleDetailViewTouch(int16_t x, int16_t y) {
  // Check back button (top left)
  if (x >= 5 && x <= 65 && y >= 5 && y <= 5 + POWER_BUTTON_SIZE) {
    currentView = VIEW_MAIN;
    displayNeedsUpdate = true;
    return;
  }
}

