bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
                // Load history for all services
                await loadHistories();
                
                renderServices();
            } catch (error) {
                console.error('Error loading services:', error);
            }
        }
        
        async function loadHistories() {
            // Load history for each service
            const historyPromises = services.map(async service => {
                try {
                    const response = await fetch(`/api/history/${service.id}`);
                    if (response.ok) {
                        const data = await response.json();
                        serviceHistories[service.id] = data;
                    }
                } catch (error) {
                    console.error(`Error loading history for ${service.name}:`, error);
                }
            });
            await Promise.all(historyPromises);
        }
        
        function renderHistoryGraph(serviceId) {
            const history = serviceHistories[serviceId];
            if (!history || !history.hourlyUptime || history.hourlyUptime.length === 0) {
                return '<div class="history-container"><span class="uptime-percentage">N/A</span></div>';
            }
            
            // Display last 90 hours (about 4 days) for readability
            // Full 30 days of data is stored but truncated for display
            const DISPLAY_HOURS = 90;
            const recentHistory = history.hourlyUptime.slice(-DISPLAY_HOURS);
            const uptimePercent = history.uptimePercentage.toFixed(1);
            
            const bars = recentHistory.map(uptime => {
                let className = 'history-bar';
                if (uptime >= 95) className += ' up-100';
                else if (uptime >= 75) className += ' up-75';
                else if (uptime >= 50) className += ' up-50';
                else if (uptime > 0) className += ' up-25';
                else className += ' up-0';
                return `<div class="${className}" title="${uptime}% uptime"></div>`;
            }).join('');
            
            return `
                <div class="history-container">
                    <div class="history-graph">${bars}</div>
                    <span class="uptime-percentage">${uptimePercent}%</span>
                </div>
            `;
        }
        
        function renderServices() {
            const tbody = document.getElementById('servicesTableBody');
            const table = document.getElementById('statusTable');
            const emptyState = document.getElementById('emptyState');
            if (services.length === 0) {
                table.classList.add('hidden');
                emptyState.classList.remove('hidden');
                return;
            }
            table.classList.remove('hidden');
            emptyState.classList.add('hidden');
            tbody.innerHTML = services.map(service => {
                let uptimeStr = 'Not checked yet';
                if (service.secondsSinceLastCheck >= 0) {
                    const seconds = service.secondsSinceLastCheck;
                    if (seconds < 60) {
                        uptimeStr = `${seconds}s ago`;
                    } else if (seconds < 3600) {
                        const minutes = Math.floor(seconds / 60);
                        const secs = seconds % 60;
                        uptimeStr = `${minutes}m ${secs}s ago`;
                    } else {
                        const hours = Math.floor(seconds / 3600);
                        const minutes = Math.floor((seconds % 3600) / 60);
                        uptimeStr = `${hours}h ${minutes}m ago`;
                    }
                }
                const isPending = service.secondsSinceLastCheck < 0;
                let statusText = service.isUp ? 'UP' : 'DOWN';
                let statusClass = service.isUp ? 'up' : 'down';
                if (isPending) {
                    statusText = 'PENDING';
                    statusClass = 'pending';
                } else if (!service.enabled) {
                    statusText = 'DISABLED';
                    statusClass = 'paused';
                } else if (service.pauseRemaining > 0) {
                    const pauseMins = Math.floor(service.pauseRemaining / 60);
                    const pauseSecs = service.pauseRemaining % 60;
                    const pauseStr = pauseMins > 0 ? `${pauseMins}m ${pauseSecs}s` : `${pauseSecs}s`;
                    statusText = `PAUSED (${pauseStr})`;
                    statusClass = 'paused';
                }
                // Format service type for display
                const typeDisplay = service.type.replace('_', ' ').toUpperCase();
                return `
                    <tr>
                        <td class="service-name">${service.name}</td>
                        <td>${typeDisplay}</td>
                        <td><span class="status-badge ${statusClass}">${statusText}</span></td>
                        <td>${renderHistoryGraph(service.id)}</td>
                        <td>${uptimeStr}</td>
                    </tr>
                `;
            }).join('');
        }
        setInterval(loadServices, 5000);
        loadServices();
    </script>
</body>
</html>)rawliteral";
}
String getAdminPage() {
  return R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ESP32 Uptime Monitor - Admin</title>
    <style>
        * {
            margin: 0;
            padding: 0;
            box-sizing: border-box;
        }

        body {
            font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, sans-serif;
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            min-height: 100vh;
            padding: 20px;
        }

        .container {
            max-width: 1200px;
            margin: 0 auto;
        }

