bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
        .header {
            text-align: center;
            color: white;
            margin-bottom: 30px;
        }

        .header h1 {
            font-size: 2.5em;
            margin-bottom: 10px;
            text-shadow: 2px 2px 4px rgba(0,0,0,0.2);
        }

        .header p {
            font-size: 1.1em;
            opacity: 0.9;
        }

        .card {
            background: white;
            border-radius: 12px;
            padding: 25px;
            margin-bottom: 20px;
            box-shadow: 0 4px 6px rgba(0,0,0,0.1);
        }

        .add-service-form {
            display: grid;
            gap: 15px;
        }

        .form-group {
            display: flex;
            flex-direction: column;
        }

        .form-row {
            display: grid;
            grid-template-columns: 1fr 1fr;
            gap: 15px;
        }

        label {
            font-weight: 600;
            margin-bottom: 5px;
            color: #333;
            font-size: 0.9em;
        }

        input, select {
            padding: 10px;
            border: 2px solid #e0e0e0;
            border-radius: 6px;
            font-size: 1em;
            transition: border-color 0.3s;
        }

        input:focus, select:focus {
            outline: none;
            border-color: #667eea;
        }

        .btn {
            padding: 12px 24px;
            border: none;
            border-radius: 6px;
            font-size: 1em;
            font-weight: 600;
            cursor: pointer;
            transition: all 0.3s;
        }

        .btn-primary {
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            color: white;
        }

        .btn-primary:hover {
            transform: translateY(-2px);
            box-shadow: 0 4px 12px rgba(102, 126, 234, 0.4);
        }

        .btn-danger {
            background: #ef4444;
            color: white;
            padding: 8px 16px;
            font-size: 0.9em;
        }

        .btn-danger:hover {
            background: #dc2626;
        }

        .btn-secondary {
            background: #6b7280;
            color: white;
        }

        .btn-secondary:hover {
            background: #4b5563;
        }

        .card-header {
            display: flex;
            justify-content: space-between;
            align-items: center;
            gap: 12px;
            margin-bottom: 20px;
        }

        .backup-actions {
            display: flex;
            gap: 10px;
            align-items: center;
            flex-wrap: wrap;
        }

        .backup-actions input[type="file"] {
            display: none;
        }

        .backup-actions .btn {
            display: inline-flex;
            align-items: center;
            justify-content: center;
            height: 44px;
            padding: 0 18px;
            line-height: 1;
            box-sizing: border-box;
            margin-bottom: 0;
        }

        .services-table {
            background: white;
            border-radius: 12px;
            padding: 25px;
            margin-top: 20px;
            box-shadow: 0 4px 6px rgba(0,0,0,0.1);
            overflow-x: auto;
        }

        .services-table table {
            width: 100%;
            border-collapse: collapse;
        }

        .services-table th {
            background: #f9fafb;
            padding: 12px 15px;
            text-align: left;
            font-weight: 600;
            color: #374151;
            border-bottom: 2px solid #e5e7eb;
            font-size: 0.9em;
        }

        .services-table td {
            padding: 12px 15px;
            border-bottom: 1px solid #e5e7eb;
            color: #6b7280;
            font-size: 0.9em;
        }

        .services-table tr:last-child td {
            border-bottom: none;
        }

        .services-table tr:hover {
            background: #f9fafb;
        }

        .services-table .service-name-cell {
            font-weight: 600;
            color: #1f2937;
        }

        .services-table .status-badge {
            display: inline-block;
            padding: 4px 10px;
            border-radius: 12px;
            font-size: 0.8em;
            font-weight: 600;
        }

        .services-table .status-badge.up {
            background: #d1fae5;
            color: #065f46;
        }

        .services-table .status-badge.down {
            background: #fee2e2;
            color: #991b1b;
        }

        .services-table .status-badge.pending {
            background: #e0e7ff;
            color: #3730a3;
        }

        .services-table .status-badge.paused {
            background: #fef3c7;
            color: #92400e;
        }

        .services-table .btn-group {
            display: flex;
            gap: 5px;
            flex-wrap: wrap;
        }

        .services-table .btn-small {
            padding: 6px 12px;
            font-size: 0.85em;
            border: none;
            border-radius: 4px;
            cursor: pointer;
            transition: all 0.2s;
            font-weight: 500;
        }

        .services-table .btn-edit {
            background: #3b82f6;
            color: white;
        }

        .services-table .btn-edit:hover {
            background: #2563eb;
        }

        .services-table .btn-pause {
            background: #f59e0b;
            color: white;
        }

        .services-table .btn-pause:hover {
            background: #d97706;
        }

        .services-table .btn-disable {
            background: #6b7280;
            color: white;
        }

        .services-table .btn-disable:hover {
            background: #4b5563;
        }

        .services-table .btn-enable {
            background: #10b981;
            color: white;
        }

        .services-table .btn-enable:hover {
            background: #059669;
        }

        .services-table .btn-delete {
            background: #ef4444;
            color: white;
        }

        .services-table .btn-delete:hover {
            background: #dc2626;
        }


        .services-grid {
            display: grid;
            grid-template-columns: repeat(auto-fill, minmax(300px, 1fr));
            gap: 20px;
        }

