bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
                <div class="form-row">
                    <div class="form-group" id="portGroup">
                        <label for="servicePort">Port</label>
                        <input type="number" id="servicePort" value="80" required>
                    </div>

                    <div class="form-group">
                        <label for="checkInterval">Check Interval (seconds)</label>
                        <input type="number" id="checkInterval" value="60" required min="10">
                    </div>
                </div>

                <div class="form-row">
                    <div class="form-group">
                        <label for="failThreshold">Fail Threshold</label>
                        <input type="number" id="failThreshold" value="3" required min="1" title="Number of consecutive failures before marking as DOWN">
                    </div>

                    <div class="form-group">
                        <label for="passThreshold">Pass Threshold</label>
                        <input type="number" id="passThreshold" value="1" required min="1" title="Number of consecutive successes before marking as UP">
                    </div>
                </div>

                <div class="form-group">
                    <label for="rearmCount">Re-arm Alert Count (0 = disabled)</label>
                    <input type="number" id="rearmCount" value="1440" required min="0" title="Number of failed checks before re-alerting while service is DOWN. Set to 0 to disable.">
                </div>

                <div class="form-group hidden" id="pathGroup">
                    <label for="servicePath">Path</label>
                    <input type="text" id="servicePath" value="/" placeholder="/">
                </div>

                <div class="form-group" id="responseGroup">
                    <label for="expectedResponse">Expected Response (* for any, regex: prefix for regex)</label>
                    <input type="text" id="expectedResponse" value="*" placeholder="*" title="Use * for any response, plain text for substring match, or regex:pattern for regex matching (e.g., regex:status.*ok)">
                </div>

                <div class="form-group hidden" id="snmpOidGroup">
                    <label for="snmpOid">SNMP OID</label>
                    <input type="text" id="snmpOid" value="" placeholder="1.3.6.1.2.1.1.1.0">
                </div>

                <div class="form-group hidden" id="snmpCommunityGroup">
                    <label for="snmpCommunity">SNMP Community String</label>
                    <input type="text" id="snmpCommunity" value="public" placeholder="public">
                </div>

                <div class="form-row hidden" id="snmpCompareGroup">
                    <div class="form-group">
                        <label for="snmpCompareOp">Comparison Operator</label>
                        <select id="snmpCompareOp">
                            <option value="=">=  (Equal)</option>
                            <option value="<>"><>  (Not Equal)</option>
                            <option value="<"><  (Less Than)</option>
                            <option value="<="><= (Less or Equal)</option>
                            <option value=">">  (Greater Than)</option>
                            <option value=">=">>= (Greater or Equal)</option>
                        </select>
                    </div>

                    <div class="form-group">
                        <label for="snmpExpectedValue">Expected Value</label>
                        <input type="text" id="snmpExpectedValue" value="" placeholder="Expected value">
                    </div>
                </div>

                <button type="submit" class="btn btn-primary">Add Service</button>
            </form>
        </div>

        <div class="card">
            <h2 style="margin: 0 0 20px 0; color: #1f2937;">Monitored Services</h2>
            <div class="services-table">
                <table>
                    <thead>
                        <tr>
                            <th>Service Name</th>
                            <th>Type</th>
                            <th>Target</th>
                            <th>Status</th>
                            <th>Last Check</th>
                            <th>Actions</th>
                        </tr>
                    </thead>
                    <tbody id="servicesTableBody">
                    </tbody>
                </table>
            </div>
        </div>
        <div id="emptyState" class="empty-state hidden">
            <h3>No services yet</h3>
            <p>Add your first service using the form above</p>
        </div>
    </div>

    <script>
        let services = [];
        let editingPushToken = null;  // Preserve pushToken when editing PUSH services

        // Update form fields based on service type
        document.getElementById('serviceType').addEventListener('change', function() {
            const type = this.value;
            const hostGroup = document.getElementById('hostGroup');
            const hostInput = document.getElementById('serviceHost');
            const urlGroup = document.getElementById('urlGroup');
            const urlInput = document.getElementById('serviceUrl');
            const pathGroup = document.getElementById('pathGroup');
            const responseGroup = document.getElementById('responseGroup');
            const portGroup = document.getElementById('portGroup');
            const portInput = document.getElementById('servicePort');
            const snmpOidGroup = document.getElementById('snmpOidGroup');
            const snmpCommunityGroup = document.getElementById('snmpCommunityGroup');
            const snmpCompareGroup = document.getElementById('snmpCompareGroup');

            if (type === 'http_get') {
                // HTTP GET uses URL field only
                hostGroup.classList.add('hidden');
                hostInput.removeAttribute('required');
                urlGroup.classList.remove('hidden');
                urlInput.setAttribute('required', '');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.remove('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
            } else if (type === 'push') {
                // Push type doesn't need host/port/path/url
                hostGroup.classList.add('hidden');
                hostInput.removeAttribute('required');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
            } else if (type === 'ping') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
            } else if (type === 'port') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.remove('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
                portInput.value = 22;
            } else if (type === 'snmp_get') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.remove('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.remove('hidden');
                snmpCommunityGroup.classList.remove('hidden');
                snmpCompareGroup.classList.remove('hidden');
                portInput.value = 161;
            }
        });

        // Add service
        document.getElementById('addServiceForm').addEventListener('submit', async function(e) {
            e.preventDefault();

            const data = {
                name: document.getElementById('serviceName').value,
                type: document.getElementById('serviceType').value,
                host: document.getElementById('serviceHost').value,
                port: parseInt(document.getElementById('servicePort').value) || 80,
                path: document.getElementById('servicePath').value,
                url: document.getElementById('serviceUrl').value,
                expectedResponse: document.getElementById('expectedResponse').value,
                checkInterval: parseInt(document.getElementById('checkInterval').value),
                passThreshold: parseInt(document.getElementById('passThreshold').value),
                failThreshold: parseInt(document.getElementById('failThreshold').value),
                rearmCount: parseInt(document.getElementById('rearmCount').value),
                snmpOid: document.getElementById('snmpOid').value,
                snmpCommunity: document.getElementById('snmpCommunity').value,
                snmpCompareOp: document.getElementById('snmpCompareOp').value,
                snmpExpectedValue: document.getElementById('snmpExpectedValue').value
            };

